trade/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Наш</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/СкладскиеОперации/СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СкладскиеОперации</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНеПринятыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>КонтрольОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ДвижениеВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииВПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ОтборИзЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВРозницу</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектовДляРазборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектующихДляСборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаНаВнутренниеНужды</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоВозвратуПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеИзлишков</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеНедостач</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеПорчи</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеРезультатовПересчетов</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуПомещениями</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоПриемка</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПродукцииИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>Пересчет</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомплектующихПослеРазборки</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваПриемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоВозвратуОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПрочемуОприходованию</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПродукцииИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСобранныхКомплектов</name>
  </enumValues>
  <enumValues>
    <name>РазмещениеВЯчейки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНеПринятыхТоваровУстарел</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеМатериаловПриПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаПродукцииДляГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаТМЦВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВыбытиеТМЦИзЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ИнвентаризацияТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСЗЕРНО</name>
    <comment>Серии, попавшие в документы интеграции с ФГИС &quot;Зерно&quot;</comment>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеССАТУРН</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/ТипыУпаковокНоменклатуры/ТипыУпаковокНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУпаковокНоменклатуры</name>
  <enumValues>
    <name>Конечная</name>
  </enumValues>
  <enumValues>
    <name>Составная</name>
  </enumValues>
  <enumValues>
    <name>Разупаковка</name>
  </enumValues>
  <enumValues>
    <name>ТоварноеМесто</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

trade/src/CommonModules/ИнтеграцияИСВызовСервераУТ/Module.bsl
// Общие механизмы интеграции ГосИС-ERP

#Область ПрограммныйИнтерфейс

// Получает массив GTIN для переданного товара и характеристики
//
// Параметры:
//  Номенклатура   - СправочникСсылка.Номенклатура - номенклатура (маркируемый товар).
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика номенклатуры (маркируемого товара).
// 
// Возвращаемое значение:
//  Массив - массив GTIN
//
Функция МассивGTINМаркированногоТовара(Номенклатура, Характеристика) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика");
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	МассивШтрихкодов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Штрихкод");
	СписокGTIN =  Новый Массив;
	
	Для Каждого Штрихкод Из МассивШтрихкодов Цикл
		
		Если МенеджерОборудованияКлиентСервер.ПроверитьКорректностьGTIN(Штрихкод) Тогда
			СписокGTIN.Добавить(Штрихкод);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокGTIN;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВидыПродукцииВТоварах(Знач Товары) Экспорт
	
	Возврат ИнтеграцияИСУТ.ВидыПродукцииВТоварах(Товары);
	
КонецФункции

// ГИСМ. Получение доступных пользователю вариантов списков документов возврата.
// Возвращаемое значение:
//  СписокЗначений - варианты форм (и их настроек) которые могут быть открыты
Функция ВозвратыТоваровОтРозничныхКлиентов(СтруктураВозврата) Экспорт
	
	Результат = Новый СписокЗначений;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ВозвратТоваровОтКлиента)
			И ПравоДоступа("Чтение", Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента) Тогда
		
		Элемент = Результат.Добавить();
		Элемент.Представление = НСтр("ru = 'Возвраты товаров от клиента'");
		Элемент.Значение = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураВозврата);
		Элемент.Значение.ИмяФормы = "Документ.ВозвратТоваровОтКлиента.Форма.ФормаСпискаДокументовГИСМ";
		Элемент.Значение.ИмяПоляОтветственный = "Менеджер";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОтчетОРозничныхВозвратах) Тогда
		
		Элемент = Результат.Добавить();
		Элемент.Представление = НСтр("ru = 'Отчеты о розничных возвратах'");
		Элемент.Значение = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураВозврата);
		Элемент.Значение.ИмяФормы = "Документ.ОтчетОРозничныхВозвратах.Форма.ФормаСпискаГИСМ";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак: партнер это розничный клиент, для торгового документа (реализация товаров, возврат от клиента).
// 
// Параметры:
//  ДокументСсылка  - ДокументСсылка.РеализацияТоваровУслуг, ДокументСсылка.ВозвратТоваровОтКлиента, ДокументСсылка.КорректировкаРеализации - Документ
// 
// Возвращаемое значение:
//  Булево - Партнер это розничный клиент в документе
Функция ПартнерЭтоРозничныйКлиентВДокументе(ДокументСсылка) Экспорт
	
	Возврат РозничныеПродажиВызовСервера.ПартнерЭтоРозничныйКлиент(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Партнер"));
	
КонецФункции

// Возвращает признак: контрагент это розничный клиент, для торгового документа (реализация товаров, возврат от клиента).
// 
// Параметры:
//  ДокументСсылка  - ДокументСсылка.РеализацияТоваровУслуг, ДокументСсылка.ВозвратТоваровОтКлиента, ДокументСсылка.КорректировкаРеализации - Документ
// 
// Возвращаемое значение:
//  Булево - Контрагент - это физическое лицо в документе
Функция КонтрагентЭтоФизическоеЛицоВДокументе(ДокументСсылка) Экспорт
	
	Возврат РозничныеПродажиВызовСервера.КонтрагентЭтоФизическоеЛицо(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Контрагент"));
	
КонецФункции

// Возвращает признак: является ли распоряжение на отгрузку документом, регулирующим внутреннее перемещение между складами.
// 
// Параметры:
//  РаспоряжениеОтборРазмещения  - ДокументСсылка.РасходныйОрдерНаТовары, ДокументСсылка.ПриходныйОрдерНаТовары, ДокументСсылка.ОтборРазмещениеТоваров - Документ
// 
// Возвращаемое значение:
//  Булево - Истина, если это ордер по внутреннему перемещению.
Функция ЭтоРаспоряжениеОрдераНаВнутреннееПеремещение(РаспоряжениеОтборРазмещения) Экспорт
	
	Если Не ЗначениеЗаполнено(РаспоряжениеОтборРазмещения) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТипЗнч(РаспоряжениеОтборРазмещения) = Тип("ДокументСсылка.РасходныйОрдерНаТовары")
		Или ТипЗнч(РаспоряжениеОтборРазмещения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Возврат (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РаспоряжениеОтборРазмещения, "СкладскаяОперация") = ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтгрузкаПоПеремещению"));
	ИначеЕсли ТипЗнч(РаспоряжениеОтборРазмещения) = Тип("ДокументСсылка.ОтборРазмещениеТоваров") Тогда
		Распоряжение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РаспоряжениеОтборРазмещения, "Распоряжение");
	    Возврат ЭтоРаспоряжениеОрдераНаВнутреннееПеремещение(Распоряжение);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает признак: расчеты по документу ведутся с розничным клиентом по ПКО
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.ПриходныйКассовыйОрдер - Документ
// 
// Возвращаемое значение:
//  Булево - расчеты с розничным клиентом
Функция РасчетыПоДокументуСРозничнымКлиентом(ДокументСсылка) Экспорт
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозяйственнаяОперация") = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
		
		Возврат РозничныеПродажиВызовСервера.ПартнерЭтоРозничныйКлиент(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Партнер"));
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Определяет, требуется ли обновление списка CDN-площадок при открытии смены
// 
// Возвращаемое значение:
//  Булево - Истина - если требуется запустить процедуру обновления
Функция ТребуетсяОбновлениеСпискаCDNПлощадок() Экспорт
	
	Возврат ОбщегоНазначенияИСМП.ТребуетсяОбновлениеСпискаCDNПлощадок();
	
КонецФункции

Функция ЭтоМернаяЕдиницаХранения(ЕдиницаИзмерения) Экспорт
	Возврат Справочники.УпаковкиЕдиницыИзмерения.ЭтоМернаяЕдиница(ЕдиницаИзмерения)
КонецФункции

Функция ДанныеУпаковкиНоменклатурыЧастичногоВыбытия(Номенклатура, ПотребительскаяУпаковка, КоэффициентУпаковкиИСМП) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("Упаковка",           Неопределено);
	ВозвращаемоеЗначение.Вставить("Числитель",          1);
	ВозвращаемоеЗначение.Вставить("Знаменатель",        КоэффициентУпаковкиИСМП);
	ВозвращаемоеЗначение.Вставить("ТипУпаковки",        Перечисления.ТипыУпаковокНоменклатуры.Разупаковка);
	ВозвращаемоеЗначение.Вставить("КоличествоУпаковок", 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка                    КАК Ссылка,
	|	Таблица.Числитель                 КАК Числитель,
	|	Таблица.Знаменатель               КАК Знаменатель,
	|	Таблица.ТипУпаковки               КАК ТипУпаковки,
	|	Таблица.КоличествоУпаковок        КАК КоличествоУпаковок,
	|	&ТекстЗапросаКоэффициентаУпаковки КАК КоэффициентУпаковки
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК Таблица
	|ГДЕ
	|	Таблица.Владелец = &Владелец";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентаУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки("Таблица.Ссылка"));
	
	ЕдиницаХранения = Справочники.УпаковкиЕдиницыИзмерения.ЕдиницаХраненияНоменклатуры(Номенклатура);
	
	Если ЗначениеЗаполнено(ПотребительскаяУпаковка)
		И ПотребительскаяУпаковка <> ЕдиницаХранения Тогда
		ВозвращаемоеЗначение.ТипУпаковки        = Перечисления.ТипыУпаковокНоменклатуры.Составная;
		КоэффициентПотребительской              = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ПотребительскаяУпаковка, Номенклатура);
		ВозвращаемоеЗначение.Знаменатель        = 1;
		ВозвращаемоеЗначение.Числитель          = КоэффициентУпаковкиИСМП * КоэффициентПотребительской;
		ВозвращаемоеЗначение.КоличествоУпаковок = КоэффициентПотребительской;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ВозвращаемоеЗначение.ТипУпаковки <> Выборка.ТипУпаковки Тогда
			Продолжить
		КонецЕсли;
		
		Если ВозвращаемоеЗначение.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Разупаковка Тогда
			Если Выборка.Знаменатель <> КоэффициентУпаковкиИСМП
				Или Выборка.Числитель <> 1 Тогда
				Продолжить;
			КонецЕсли;
		ИначеЕсли ВозвращаемоеЗначение.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Составная Тогда
			Если Выборка.КоличествоУпаковок <> ВозвращаемоеЗначение.КоличествоУпаковок
				Или Выборка.Знаменатель <> 1
				Или Выборка.Числитель <> ВозвращаемоеЗначение.Числитель Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ВозвращаемоеЗначение.Упаковка = Выборка.Ссылка;
		Прервать;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция - Коэффициент упаковки
//
// Параметры:
//  Упаковка	 - 	СправочникСсылка.УпаковкиЕдиницыИзмерения - упаковка, коэффициент которой нужно получить
//  Номенклатура - 	СправочникСсылка.Номенклатура - обязательно для указания, если упаковка НЕ типа "Упаковка".
// 
// Возвращаемое значение:
//  Число - коэффициент упаковки
//
Функция КоэффициентУпаковки(Упаковка, Номенклатура) Экспорт
	Возврат Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Упаковка, Номенклатура);
КонецФункции

Функция ДокументыСОшибкамиПроверкиЗаполненияКодовМаркировки(ДокументыМассив, СообщатьОбОшибках = Истина) Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	Для Каждого ПроверяемыйДокумент Из ДокументыМассив Цикл
		
		Источники = Новый Массив();
		
		ТипДокумента = ТипЗнч(ПроверяемыйДокумент);
		Если ТипДокументаПоддерживаетПроверкуНаличияКодовМаркировки(ТипДокумента) Тогда
			Источники.Добавить(ПроверяемыйДокумент);
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ДокументыОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроверяемыйДокумент, "ДокументыОснования").Выгрузить();
			Для Каждого СтрокаТаблицы Из ДокументыОснования Цикл
				Если ТипДокументаПоддерживаетПроверкуНаличияКодовМаркировки(ТипЗнч(СтрокаТаблицы.ДокументОснование)) Тогда
					Источники.Добавить(СтрокаТаблицы.ДокументОснование);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
			ДокументПродажи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроверяемыйДокумент, "ДокументПродажи");
			Если ЗначениеЗаполнено(ДокументПродажи)
				И ТипДокументаПоддерживаетПроверкуНаличияКодовМаркировки(ТипЗнч(ДокументПродажи)) Тогда
				Источники.Добавить(ДокументПродажи);
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиПроверкиДокумента = Ложь;
		ИнтеграцияИСУТ.ПроверитьЗаполнениеАкцизныхМарокПоСсылкам(Источники, ЕстьОшибкиПроверкиДокумента,, СообщатьОбОшибках, Истина);
		Если ЕстьОшибкиПроверкиДокумента Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ДокументыМассив, ПроверяемыйДокумент);
			ВозвращаемоеЗначение.Добавить(ПроверяемыйДокумент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция РезультатПроверкиПроведенностиДокументовИЗаполненияКодовМаркировки(ДокументыМассив) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ДокументыСОшибкамиПроверкиЗаполненияКодовМаркировки", Новый Массив);
	ВозвращаемоеЗначение.Вставить(
		"ДокументыТребующиеПроведение",
		ОбщегоНазначенияВызовСервера.ПроверитьПроведенностьДокументов(ДокументыМассив));
	
	Если ВозвращаемоеЗначение.ДокументыТребующиеПроведение.Количество() = 0 Тогда
		ВозвращаемоеЗначение.ДокументыСОшибкамиПроверкиЗаполненияКодовМаркировки = ДокументыСОшибкамиПроверкиЗаполненияКодовМаркировки(ДокументыМассив);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция возвращает код ТНВЭД строкой по переданному элементу справочника КлассификаторТНВЭД.
// 
// Параметры:
//  КодТНВЭД - СправочникСсылка.КлассификаторТНВЭД
// 
// Возвращаемое значение:
//  Строка - код ТНВЭД строкой
Функция ПолучитьКодТНВЭД(КодТНВЭД) Экспорт
	
	Если Не ЗначениеЗаполнено(КодТНВЭД) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КодТНВЭД, "Код");
	
КонецФункции

// Функция возвращает элемент справочник КлассификаторТНВЭД по коду, переданному строкой.
// 
// Параметры:
//  ЗначениеПоиска - Строка - строка поиска
// 
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторТНВЭД, Неопределено - найденный элемент справочника
Функция НайтиЭлементКодТНВЭДПоКоду(ЗначениеПоиска) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗначениеПоиска) Тогда
		Возврат Справочники.КлассификаторТНВЭД.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Справочники.КлассификаторТНВЭД.НайтиПоКоду(ЗначениеПоиска);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипДокументаПоддерживаетПроверкуНаличияКодовМаркировки(ТипДокумента)
	Возврат (ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		Или ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации")
		Или ТипДокумента = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями")
		Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями")
		Или ТипДокумента = Тип("ДокументСсылка.ПередачаТоваровХранителю"));
КонецФункции

#КонецОбласти
